#### HideElementsTemporary Method

---

|  |
| --- |
| View Class   See Also |

Set multiple elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void HideElementsTemporary( 	ICollection<ElementId> elementIdSet ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub HideElementsTemporary ( _ 	elementIdSet As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void HideElementsTemporary( 	ICollection<ElementId^>^ elementIdSet ) ``` |

#### Parameters

elementIdSet
:   Type:  System.Collections.Generic ICollection   ElementId
     Ids of the elements to be temporarily hidden.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View Class

Autodesk.Revit.DB Namespace